node {
  name: "Placeholder/feature"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 725
        }
      }
    }
  }
}
node {
  name: "Placeholder/lstm_cell"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 16
        }
      }
    }
  }
}
node {
  name: "Placeholder/lstm_hidden"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 16
        }
      }
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\325\002\000\000"
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "Placeholder/feature"
  input: "Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\325\002\000\000"
      }
    }
  }
}
node {
  name: "Reshape_1"
  op: "Reshape"
  input: "Reshape"
  input: "Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "feature_vec"
  op: "Identity"
  input: "Reshape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Reshape_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\020\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape_2"
  op: "Reshape"
  input: "Placeholder/lstm_cell"
  input: "Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Reshape_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\020\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape_3"
  op: "Reshape"
  input: "Placeholder/lstm_hidden"
  input: "Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "feature_vec_split/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\344\001\000\000\220\000\000\000H\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split"
  op: "SplitV"
  input: "feature_vec"
  input: "feature_vec_split/Const"
  input: "feature_vec_split/split/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "feature_vec_split/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\353\000\000\000\353\000\000\000\016\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split_1/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_1"
  op: "SplitV"
  input: "feature_vec_split/split"
  input: "feature_vec_split/Const_1"
  input: "feature_vec_split/split_1/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 3
    }
  }
}
node {
  name: "feature_vec_split/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "H\000\000\000H\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split_2/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_2"
  op: "SplitV"
  input: "feature_vec_split/split:1"
  input: "feature_vec_split/Const_2"
  input: "feature_vec_split/split_2/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "feature_vec_split/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "$\000\000\000$\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split_3/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_3"
  op: "SplitV"
  input: "feature_vec_split/split:2"
  input: "feature_vec_split/Const_3"
  input: "feature_vec_split/split_3/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "feature_vec_split/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\022\000\000\000\022\000\000\000\022\000\000\000\022\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split_4/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_4"
  op: "SplitV"
  input: "feature_vec_split/split_2"
  input: "feature_vec_split/Const_4"
  input: "feature_vec_split/split_4/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "feature_vec_split/Const_5"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\022\000\000\000\022\000\000\000\022\000\000\000\022\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split_5/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_5"
  op: "SplitV"
  input: "feature_vec_split/split_2:1"
  input: "feature_vec_split/Const_5"
  input: "feature_vec_split/split_5/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "feature_vec_split/Const_6"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\022\000\000\000\022\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split_6/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_6"
  op: "SplitV"
  input: "feature_vec_split/split_3"
  input: "feature_vec_split/Const_6"
  input: "feature_vec_split/split_6/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "feature_vec_split/Const_7"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\022\000\000\000\022\000\000\000"
      }
    }
  }
}
node {
  name: "feature_vec_split/split_7/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_7"
  op: "SplitV"
  input: "feature_vec_split/split_3:1"
  input: "feature_vec_split/Const_7"
  input: "feature_vec_split/split_7/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "feature_vec_split/Const_8"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 235
      }
    }
  }
}
node {
  name: "feature_vec_split/split_8/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_8"
  op: "SplitV"
  input: "feature_vec_split/split_1"
  input: "feature_vec_split/Const_8"
  input: "feature_vec_split/split_8/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 1
    }
  }
}
node {
  name: "feature_vec_split/Const_9"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 235
      }
    }
  }
}
node {
  name: "feature_vec_split/split_9/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_9"
  op: "SplitV"
  input: "feature_vec_split/split_1:1"
  input: "feature_vec_split/Const_9"
  input: "feature_vec_split/split_9/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 1
    }
  }
}
node {
  name: "feature_vec_split/Const_10"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 14
      }
    }
  }
}
node {
  name: "feature_vec_split/split_10/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "feature_vec_split/split_10"
  op: "SplitV"
  input: "feature_vec_split/split_1:2"
  input: "feature_vec_split/Const_10"
  input: "feature_vec_split/split_10/split_dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 1
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 32
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000\016\000\000\000"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "hero_main/fc1_hero_main_weight/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/random_normal/mul"
  op: "Mul"
  input: "hero_main/fc1_hero_main_weight/Initializer/random_normal/RandomStandardNormal"
  input: "hero_main/fc1_hero_main_weight/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/random_normal"
  op: "Add"
  input: "hero_main/fc1_hero_main_weight/Initializer/random_normal/mul"
  input: "hero_main/fc1_hero_main_weight/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/Qr"
  op: "Qr"
  input: "hero_main/fc1_hero_main_weight/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "full_matrices"
    value {
      b: false
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/DiagPart"
  op: "DiagPart"
  input: "hero_main/fc1_hero_main_weight/Initializer/Qr:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/Sign"
  op: "Sign"
  input: "hero_main/fc1_hero_main_weight/Initializer/DiagPart"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/mul"
  op: "Mul"
  input: "hero_main/fc1_hero_main_weight/Initializer/Qr"
  input: "hero_main/fc1_hero_main_weight/Initializer/Sign"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/matrix_transpose/transpose/perm"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/matrix_transpose/transpose"
  op: "Transpose"
  input: "hero_main/fc1_hero_main_weight/Initializer/mul"
  input: "hero_main/fc1_hero_main_weight/Initializer/matrix_transpose/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/Reshape/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\016\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/Reshape"
  op: "Reshape"
  input: "hero_main/fc1_hero_main_weight/Initializer/matrix_transpose/transpose"
  input: "hero_main/fc1_hero_main_weight/Initializer/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/mul_1/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Initializer/mul_1"
  op: "Mul"
  input: "hero_main/fc1_hero_main_weight/Initializer/mul_1/x"
  input: "hero_main/fc1_hero_main_weight/Initializer/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 14
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/Assign"
  op: "Assign"
  input: "hero_main/fc1_hero_main_weight"
  input: "hero_main/fc1_hero_main_weight/Initializer/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_weight/read"
  op: "Identity"
  input: "hero_main/fc1_hero_main_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_bias/Assign"
  op: "Assign"
  input: "hero_main/fc1_hero_main_bias"
  input: "hero_main/fc1_hero_main_bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_bias/read"
  op: "Identity"
  input: "hero_main/fc1_hero_main_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc1_hero_main_bias"
      }
    }
  }
}
node {
  name: "hero_main/MatMul"
  op: "MatMul"
  input: "feature_vec_split/split_10"
  input: "hero_main/fc1_hero_main_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "hero_main/add"
  op: "Add"
  input: "hero_main/MatMul"
  input: "hero_main/fc1_hero_main_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hero_main/fc1_hero_main_result_0"
  op: "Relu"
  input: "hero_main/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "hero_main/fc2_hero_main_weight/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/random_normal/mul"
  op: "Mul"
  input: "hero_main/fc2_hero_main_weight/Initializer/random_normal/RandomStandardNormal"
  input: "hero_main/fc2_hero_main_weight/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/random_normal"
  op: "Add"
  input: "hero_main/fc2_hero_main_weight/Initializer/random_normal/mul"
  input: "hero_main/fc2_hero_main_weight/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/Qr"
  op: "Qr"
  input: "hero_main/fc2_hero_main_weight/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "full_matrices"
    value {
      b: false
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/DiagPart"
  op: "DiagPart"
  input: "hero_main/fc2_hero_main_weight/Initializer/Qr:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/Sign"
  op: "Sign"
  input: "hero_main/fc2_hero_main_weight/Initializer/DiagPart"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/mul"
  op: "Mul"
  input: "hero_main/fc2_hero_main_weight/Initializer/Qr"
  input: "hero_main/fc2_hero_main_weight/Initializer/Sign"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/Reshape/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/Reshape"
  op: "Reshape"
  input: "hero_main/fc2_hero_main_weight/Initializer/mul"
  input: "hero_main/fc2_hero_main_weight/Initializer/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/mul_1/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Initializer/mul_1"
  op: "Mul"
  input: "hero_main/fc2_hero_main_weight/Initializer/mul_1/x"
  input: "hero_main/fc2_hero_main_weight/Initializer/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/Assign"
  op: "Assign"
  input: "hero_main/fc2_hero_main_weight"
  input: "hero_main/fc2_hero_main_weight/Initializer/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_weight/read"
  op: "Identity"
  input: "hero_main/fc2_hero_main_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_bias/Assign"
  op: "Assign"
  input: "hero_main/fc2_hero_main_bias"
  input: "hero_main/fc2_hero_main_bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_bias/read"
  op: "Identity"
  input: "hero_main/fc2_hero_main_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc2_hero_main_bias"
      }
    }
  }
}
node {
  name: "hero_main/MatMul_1"
  op: "MatMul"
  input: "hero_main/fc1_hero_main_result_0"
  input: "hero_main/fc2_hero_main_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "hero_main/add_1"
  op: "Add"
  input: "hero_main/MatMul_1"
  input: "hero_main/fc2_hero_main_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hero_main/fc2_hero_main_result_0"
  op: "Relu"
  input: "hero_main/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "hero_main/fc3_hero_main_weight/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/random_normal/mul"
  op: "Mul"
  input: "hero_main/fc3_hero_main_weight/Initializer/random_normal/RandomStandardNormal"
  input: "hero_main/fc3_hero_main_weight/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/random_normal"
  op: "Add"
  input: "hero_main/fc3_hero_main_weight/Initializer/random_normal/mul"
  input: "hero_main/fc3_hero_main_weight/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/Qr"
  op: "Qr"
  input: "hero_main/fc3_hero_main_weight/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "full_matrices"
    value {
      b: false
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/DiagPart"
  op: "DiagPart"
  input: "hero_main/fc3_hero_main_weight/Initializer/Qr:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/Sign"
  op: "Sign"
  input: "hero_main/fc3_hero_main_weight/Initializer/DiagPart"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/mul"
  op: "Mul"
  input: "hero_main/fc3_hero_main_weight/Initializer/Qr"
  input: "hero_main/fc3_hero_main_weight/Initializer/Sign"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/Reshape/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/Reshape"
  op: "Reshape"
  input: "hero_main/fc3_hero_main_weight/Initializer/mul"
  input: "hero_main/fc3_hero_main_weight/Initializer/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/mul_1/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Initializer/mul_1"
  op: "Mul"
  input: "hero_main/fc3_hero_main_weight/Initializer/mul_1/x"
  input: "hero_main/fc3_hero_main_weight/Initializer/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/Assign"
  op: "Assign"
  input: "hero_main/fc3_hero_main_weight"
  input: "hero_main/fc3_hero_main_weight/Initializer/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_weight/read"
  op: "Identity"
  input: "hero_main/fc3_hero_main_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_weight"
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_bias/Assign"
  op: "Assign"
  input: "hero_main/fc3_hero_main_bias"
  input: "hero_main/fc3_hero_main_bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_bias/read"
  op: "Identity"
  input: "hero_main/fc3_hero_main_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_main/fc3_hero_main_bias"
      }
    }
  }
}
node {
  name: "hero_main/MatMul_2"
  op: "MatMul"
  input: "hero_main/fc2_hero_main_result_0"
  input: "hero_main/fc3_hero_main_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "hero_main/fc3_hero_main_result_0"
  op: "Add"
  input: "hero_main/MatMul_2"
  input: "hero_main/fc3_hero_main_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\002\000\000\353\000\000\000"
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "hero_share/fc1_hero_weight/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/random_normal/mul"
  op: "Mul"
  input: "hero_share/fc1_hero_weight/Initializer/random_normal/RandomStandardNormal"
  input: "hero_share/fc1_hero_weight/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/random_normal"
  op: "Add"
  input: "hero_share/fc1_hero_weight/Initializer/random_normal/mul"
  input: "hero_share/fc1_hero_weight/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/Qr"
  op: "Qr"
  input: "hero_share/fc1_hero_weight/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
  attr {
    key: "full_matrices"
    value {
      b: false
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/DiagPart"
  op: "DiagPart"
  input: "hero_share/fc1_hero_weight/Initializer/Qr:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/Sign"
  op: "Sign"
  input: "hero_share/fc1_hero_weight/Initializer/DiagPart"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/mul"
  op: "Mul"
  input: "hero_share/fc1_hero_weight/Initializer/Qr"
  input: "hero_share/fc1_hero_weight/Initializer/Sign"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
}
node {
  name: "hero_share/fc1_hero_weight/Initializer/matrix_transpose/transpose/perm"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hero_share/fc1_hero_weight"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
